# RSM 2401 Group Assignment 1

Deliverables (to be submitted on Quercus):
All SQL source code / answers in a Jupyter Notebook (*.ipynb).
Based on the Premier Products database that we created in class, answer the following questions using SQL commands. State these questions in markdown cells in your Jupyter notebook and fill in the answer in between.

In [1]:
# preparation

# install SQL module
#!pip install ipython-sql

In [2]:
# Loading the SQL module
%load_ext sql

In [3]:
# Connect to a SQLite database
%sql sqlite://

'Connected: @None'

In [4]:
# Create table REP

In [5]:
%%sql 
CREATE TABLE REP 
(REP_NUM CHAR(2) PRIMARY KEY,
 LAST_NAME CHAR(15) NOT NULL,
 FIRST_NAME CHAR(15) NOT NULL,
 STREET CHAR(15),
 CITY CHAR(15),
 STATE CHAR(2),
 ZIP CHAR(5),
 COMMISSION DECIMAL(7,2),
 RATE DECIMAL(3,2) );

 * sqlite://
Done.

[]

In [6]:
%%sql 
insert into REP VALUES
('20','Kaiser','Valerie', '624 Randall','Grove','FL','33321',20542.50,0.05);
insert into REP VALUES
('35','Hull','Richard','532 Jackson','Sheldon','FL',33553,39216,.07);
insert into REP VALUES
('65','Perez','Juan','1626 Taylor','Fillmore','FL',33553,23487,.05);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
select * from REP

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 20542.5, 0.05),
 ('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
 ('65', 'Perez', 'Juan', '1626 Taylor', 'Fillmore', 'FL', '33553', 23487, 0.05)]

In [8]:
# Create table CUSTOMER

In [9]:
%%sql
create table CUSTOMER
(customer_num char(3) primary key,
customer_name char(35) not null,
street char(15),
city char(15),
state char(12),
zip char(5),
balance decimal(8,2),
credit_limit decimal(8,2),
rep_num char(2));

 * sqlite://
Done.

[]

In [10]:
%%sql
INSERT INTO CUSTOMER
VALUES
('148','Al''s Appliance and Sport','2837 Greenway','Fillmore','FL','33336',6550.00,7500.00,'20');
INSERT INTO CUSTOMER
VALUES
('282','Brookings Direct','3827 Devon','Grove','FL','33321',431.50,10000.00,'35');
INSERT INTO CUSTOMER
VALUES
('356','Ferguson''s','382 Wildwood','Northfield','FL','33146',5785.00,7500.00,'65');
INSERT INTO CUSTOMER
VALUES
('408','The Everything Shop','1828 Raven','Crystal','FL','33503',5285.25,5000.00,'35');
INSERT INTO CUSTOMER
VALUES
('462','Bargains Galore','3829 Central','Grove','FL','33321',3412.00,10000.00,'65');
INSERT INTO CUSTOMER
VALUES
('524','Kline''s','838 Ridgeland','Fillmore','FL','33336',12762.00,15000.00,'20');
INSERT INTO CUSTOMER
VALUES
('608','Johnson''s Department Store','372 Oxford','Sheldon','FL','33553',2106.00,10000.00,'65');
INSERT INTO CUSTOMER
VALUES
('687','Lee''s Sport and Appliance','282 Evergreen','Altonville','FL','32543',2851.00,5000.00,'35');
INSERT INTO CUSTOMER
VALUES
('725','Deerfield''s Four Seasons','282 Columbia','Sheldon','FL','33553',248.00,7500.00,'35');
INSERT INTO CUSTOMER
VALUES
('842','All Season','28 Lakeview','Grove','FL','33321',8221.00,7500.00,'20');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
# Create table ORDERS

In [12]:
%%sql
CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3));

 * sqlite://
Done.

[]

In [13]:
%%sql
INSERT INTO ORDERS
VALUES
('21608','20-OCT-2010','148');
INSERT INTO ORDERS
VALUES
('21610','20-OCT-2010','356');
INSERT INTO ORDERS
VALUES
('21613','21-OCT-2010','408');
INSERT INTO ORDERS
VALUES
('21614','21-OCT-2010','282');
INSERT INTO ORDERS
VALUES
('21617','23-OCT-2010','608');
INSERT INTO ORDERS
VALUES
('21619','23-OCT-2010','148');
INSERT INTO ORDERS
VALUES
('21623','23-OCT-2010','608');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%sql select * from ORDERS

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148'),
 ('21610', '20-OCT-2010', '356'),
 ('21613', '21-OCT-2010', '408'),
 ('21614', '21-OCT-2010', '282'),
 ('21617', '23-OCT-2010', '608'),
 ('21619', '23-OCT-2010', '148'),
 ('21623', '23-OCT-2010', '608')]

In [ ]:
# Create table PART

In [15]:
%%sql
CREATE TABLE PART
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2) );

 * sqlite://
Done.

[]

In [16]:
%%sql
INSERT INTO PART VALUES
('AT94','Iron',50,'HW','3',24.95),
('BV06','Home Gym',45,'SG','2',794.95),
('CD52','Microwave Oven',32,'AP','1',165.00),
('DL71','Cordless Drill',21,'HW','3',129.95),
('DR93','Gas Range',8,'AP','2',495.00),
('DW11','Washer',12,'AP','3',399.99),
('FD21','Stand Mixer',22,'HW','3',159.95),
('KL62','Dryer',12,'AP','1',349.95),
('KT03','Dishwasher',8,'AP','3',595.00),
('KV29','Treadmill',9,'SG','2',1390.00);

 * sqlite://
10 rows affected.

[]

In [ ]:
# Create table ORDER_LINE

In [17]:
%%sql
CREATE TABLE ORDER_LINE
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (ORDER_NUM, PART_NUM) );

 * sqlite://
Done.

[]

In [18]:
%%sql
INSERT INTO ORDER_LINE VALUES
('21608','AT94',11,21.95),
('21610','DR93',1,495.00),
('21610','DW11',1,399.99),
('21613','KL62',4,329.95),
('21614','KT03',2,595.00),
('21617','BV06',2,794.95),
('21617','CD52',4,150.00),
('21619','DR93',1,495.00),
('21623','KV29',2,1290.00);

 * sqlite://
9 rows affected.

[]

The dat ashould be ready now.

## Part A

## A.1. List the names of all customers that have a credit limit of $7,500 or less.

In [19]:
%%sql
select customer_name from customer where credit_limit <= 7500

 * sqlite://
Done.

[("Al's Appliance and Sport",),
 ("Ferguson's",),
 ('The Everything Shop',),
 ("Lee's Sport and Appliance",),
 ("Deerfield's Four Seasons",),
 ('All Season',)]

In [2]:
# write your code here

## Part B

In [3]:
# write your code here

## Part C

In [4]:
# write your code here

## Part D

In [5]:
# write your code here